//
//  Character.swift
//  DevilHouse
//
//  Created by Naito Seishiro on 2015/10/07.
//  Copyright © 2015年 Itia. All rights reserved.
//

import UIKit

class Character {
    let text1:[String]=["a","b","c","d","e"]
    let text2:[String]=["ab","ac","ad","ae","af","ag"]
    let text3:[String]=["ba","bb","bc"]
    let text4:[String]=["cja","chb","ccg","cda","cew","cfd","cr","ck","cg","cx","cj"]
    let text5:[String]=["abx","yth","btwny","nty","vdaf","trb","muet","rtwgs","bgs","rbn","nrb","nrwytbtr","nty","nty"]
    let text6:[String]=["あ","い","う","え","お","か","き","く","け","こ","さ","し","す","せ","そ","た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ","ま","み","む","め","も","ら","り","る","れ","ろ","や","ゆ","よ","わ","を","ん"]
/* 実際の文章はここに表示
    let text1:[String]=["ここが魔王の城か","魔王はどこだろう","敵か！？","ゴブリンだ","肩慣らしには丁度いいな","早く魔王を見つけないと","俺の剣を受けてみろ","","","","","",""]
    let text2:[String]=["よーしレベルが上がったぞ","村のみんな心配してるかな","","","","","","","","","","","","","","","","","","","","",""]
    let text3:[String]=["魔王様のところへ行かせはしないぞ","骨の魔法使いか？™,"厄介だな","敵も強くなってきたな","かすり傷を食らったぜ","敵は魔法を使ってくるのか","ようやく半分だな","結構ダメージを食らったな","","","",""]
    let text4:[String]=["古のドラゴンか","こいつが村を襲ったんだな","負けはしないぞ","よしレベルが上がった","あと少しで魔王のところだ","炎の攻撃だ！","薬草を使うぞ","","","","","","","",""]
 //  let text5:[String]=["よくきたな小僧","お前が魔王か！","貴様ごときに負けはしないぞ","真の恐怖を教えてやろう","ここで死ぬわけにはいかない","受けてみろ俺の必殺","ククク、我を本気にさせたな","地獄に堕ちるがいい","俺の力はこんなものでは、、、","貴様に世界の半分をやろう","静まれ！俺の左手よ","最後に命乞いをさせてやろう","","","","","","","","","","",""]

*/
    
}